app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    if request.headers["Authorization"].present?
      token = request.headers["Authorization"].split(" ").last
      begin
        decoded_token = JWT.decode(
          token,
          "random",
          true,
          { algorithm: "HS256" }
        )
        User.find_by(id: decoded_token[0]["user"])